{
  "backend/main.mo": "Main Motoko actor defining the backend for Drone X Solutions, including data types and CRUD operations for services, testimonials, gallery images, booking requests, user profiles, homepage content, and site theme, with authorization via AccessControl and blob storage via MixinStorage.",
  "feature_evidence.json": "Feature evidence report mapping implemented feature IDs to their titles, affected files, components, and test IDs, primarily documenting text color fixes (to #FFFFFF) across multiple frontend section components for dark-background contrast.",
  "frontend-file-summaries.txt": "JSON-formatted catalog of short summaries for each frontend source file, describing the purpose and key changes of components, hooks, and pages in the project.",
  "frontend/index.css": "Global Tailwind CSS entry point that defines CSS custom property design tokens for light and dark themes (colors, radius, chart, sidebar variables) and applies base border and background/text styles to all elements.",
  "frontend/index.html": "Minimal HTML shell for the Drone X Solutions React app, setting the page title and mounting the app into a root div via the main.tsx module script.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with routes for home, admin login, and admin panel, wraps everything in a QueryClientProvider, and calls useThemeLoader via AppWithTheme to apply backend-driven theme colors on load.",
  "frontend/src/components/AboutSection.tsx": "About section component displaying company story, body text from backend or default, and highlight cards with icons; all text is explicitly set to text-white or text-white/80 for visibility on dark backgrounds.",
  "frontend/src/components/admin/AdminBookingsTab.tsx": "Admin tab that lists booking requests as expandable cards, showing contact details and providing email/WhatsApp reply actions.",
  "frontend/src/components/admin/AdminGalleryTab.tsx": "Admin tab for managing before/after gallery image pairs, supporting file upload with progress tracking, preview, and deletion via mutation hooks.",
  "frontend/src/components/admin/AdminHomepageTab.tsx": "Admin tab for editing homepage hero and about section content, including hero image upload with progress tracking and save functionality via mutation hooks.",
  "frontend/src/components/admin/AdminServicesTab.tsx": "Admin tab component for managing services, supporting add/edit/delete operations with image upload and falling back to default services when none are stored.",
  "frontend/src/components/admin/AdminTestimonialsTab.tsx": "Admin tab component for managing customer testimonials with add/edit/delete functionality and a form for name, rating, text, service, and location fields.",
  "frontend/src/components/admin/AdminThemeTab.tsx": "Admin tab for editing site theme colors (primary, accent, background) with a color picker, hex input, save, and reset to defaults functionality.",
  "frontend/src/components/admin/AdminTranslationsTab.tsx": "Admin tab for editing site translations for Greek and Russian languages, organized by section groups with per-key reset and bulk save support.",
  "frontend/src/components/AdminGuard.tsx": "Authorization wrapper component that checks Internet Identity login status and admin privileges, rendering login prompts, a loading spinner, or an access-denied message before allowing children to render.",
  "frontend/src/components/BookingForm.tsx": "A booking request form component with fields for name, email, phone, location, service type, preferred date, and message, including validation and submission via a React Query mutation. Shows a success confirmation screen after successful submission.",
  "frontend/src/components/ContactSection.tsx": "Displays company contact information (phone, email, address), a WhatsApp CTA button, and social media links (Facebook, Instagram, LinkedIn) with icons and translations.",
  "frontend/src/components/GallerySection.tsx": "Renders a before/after image gallery grid fetched from the backend, falling back to default static entries, with toggle buttons to switch between before and after views per item.",
  "frontend/src/components/HeroSection.tsx": "Full-screen hero section with a background image, animated badge, dynamic title/subtitle from CMS or defaults, CTA buttons that scroll to booking/gallery sections, and a stats row.",
  "frontend/src/components/Layout.tsx": "Main site layout providing a fixed header with logo, desktop/mobile navigation, language switcher, and admin logout button, with scroll-based styling and smooth section scrolling.",
  "frontend/src/components/LoginButton.tsx": "A button component that handles Internet Identity login and logout, showing a loading spinner during authentication and clearing the React Query cache on logout.",
  "frontend/src/components/ServicesSection.tsx": "Displays a grid of drone cleaning services, falling back to hardcoded defaults if no backend data is available, with loading skeleton states and icon/image support via ExternalBlob.",
  "frontend/src/components/TestimonialsSection.tsx": "Renders a grid of customer testimonials with star ratings, using backend data when available and falling back to hardcoded Greek customer defaults, with loading skeletons.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and caches an ICP backend actor using the current Internet Identity, initializing admin access control when authenticated and invalidating dependent queries on actor change.",
  "frontend/src/hooks/useAdminCheck.ts": "Thin hook that exposes admin authentication status by delegating to useAdminSession.",
  "frontend/src/hooks/useAdminSession.ts": "Hook managing a simple username/password admin session stored in sessionStorage, with global state synchronization across components via a listener set.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing DFINITY Internet Identity authentication, including login, logout, and identity persistence via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating backend data including homepage content, services, testimonials, gallery images, bookings, and site theme, each invalidating relevant query caches on success.",
  "frontend/src/hooks/useThemeLoader.ts": "Fetches the site theme from the backend and applies primary, accent, and background colors as CSS custom properties on the document root, falling back to a default black-and-orange palette.",
  "frontend/src/hooks/useTranslation.ts": "Manages multi-language translation state using a global variable and localStorage, exposing helpers to get/set the active language, translate keys, and save custom per-language overrides.",
  "frontend/src/index.css": "Defines global CSS custom properties for the design token system (colors, radius, etc.), imports Tailwind layers, sets typography defaults, and adds utility classes for gradients, glows, and scrollbar styling.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrappers around the root App component.",
  "frontend/src/pages/AdminLoginPage.tsx": "Renders a username/password login form for admin access, using useAdminSession to authenticate and redirecting to the admin panel on success or showing an error message on failure.",
  "frontend/src/pages/AdminPanel.tsx": "Protected admin dashboard page that renders tabbed management sections for homepage, services, testimonials, gallery, bookings, translations, and theme, redirecting unauthenticated users to the login page.",
  "frontend/src/pages/HomePage.tsx": "Composes the public-facing homepage by rendering all section components in order: hero, services, about, testimonials, gallery, booking form, and contact.",
  "frontend/src/utils/translations.ts": "Defines TypeScript types for supported languages and translation keys, and exports default translation objects for English, Greek, and Russian covering all UI strings used across the app.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining a custom design system with oklch-based color tokens, custom fonts (Montserrat, Inter), industrial/amber box shadows, and animation keyframes.",
  "project_state.json": "Project state file tracking a fix request to apply bright white (#FFFFFF) text across all public-facing site sections (ServicesSection, Layout, AboutSection, HeroSection, etc.) for contrast on dark backgrounds."
}