{
  "backend/main.mo": "Main Motoko actor for the Drone X Solutions backend, defining data types and CRUD operations for homepage content, services, testimonials, gallery images, booking requests, and user profiles, with role-based access control via MixinAuthorization.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features listed.",
  "frontend-file-summaries.txt": "JSON file containing short summaries of three frontend source files: App.tsx, AdminGalleryTab.tsx, and AdminBookingsTab.tsx.",
  "frontend/index.css": "Global CSS file that imports Tailwind directives and defines CSS custom properties for the design system's color tokens in both light and dark modes.",
  "frontend/index.html": "HTML entry point for the Drone X Solutions frontend app, mounting the React app into a root div and loading the main TSX module.",
  "frontend/src/App.tsx": "Main React application entry point that configures TanStack Router with a root layout route containing home (`/`) and admin (`/admin`) child routes.",
  "frontend/src/components/AboutSection.tsx": "React component rendering the About section of the homepage, displaying fetched about text alongside team/drone images and a grid of four company highlight cards.",
  "frontend/src/components/admin/AdminBookingsTab.tsx": "Displays all booking requests in expandable cards with contact details, and provides quick reply actions via email or WhatsApp.",
  "frontend/src/components/admin/AdminGalleryTab.tsx": "Admin tab for managing before/after gallery image pairs, supporting file upload with progress tracking, addition, and removal.",
  "frontend/src/components/admin/AdminHomepageTab.tsx": "Admin form for editing homepage content fields (hero title, subtitle, CTA text, about text, and hero image) with save and upload progress support.",
  "frontend/src/components/admin/AdminServicesTab.tsx": "Admin tab for managing services with add, edit, and delete functionality, falling back to a set of default services if none are stored.",
  "frontend/src/components/admin/AdminTestimonialsTab.tsx": "Admin tab for creating, editing, and deleting customer testimonials including rating, service, and location fields.",
  "frontend/src/components/AdminGuard.tsx": "React component that gates its children behind Internet Identity authentication and admin privilege checks, showing login or access-denied UI as appropriate.",
  "frontend/src/components/BookingForm.tsx": "React component rendering a booking request form with fields for name, email, phone, service type, location, date, and message, submitting to the backend and showing a success state on completion.",
  "frontend/src/components/ContactSection.tsx": "React component displaying the Contact section with phone, email, location info, social media links, and a WhatsApp contact button.",
  "frontend/src/components/GallerySection.tsx": "Renders a before/after gallery section fetching images from the backend, falling back to placeholder data, with each card allowing toggling between before and after images.",
  "frontend/src/components/HeroSection.tsx": "Displays the full-screen hero section with a dynamic background image, CMS-driven title/subtitle/CTA text, stats, and scroll-to-section buttons.",
  "frontend/src/components/Layout.tsx": "Provides the app shell with a fixed header, responsive navigation (desktop and mobile), admin link for admin users, and renders child content below.",
  "frontend/src/components/LoginButton.tsx": "Renders a login/logout button using Internet Identity authentication, toggling state and clearing the React Query cache on logout.",
  "frontend/src/components/ServicesSection.tsx": "Displays a grid of drone cleaning services fetched from the backend, falling back to a hardcoded default list with icons and descriptions.",
  "frontend/src/components/TestimonialsSection.tsx": "Renders a testimonials section with star ratings fetched from the backend, falling back to placeholder customer reviews when no data is available.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches an authenticated or anonymous backend actor, initializing admin access control when an identity is present.",
  "frontend/src/hooks/useAdminCheck.ts": "Hook that combines identity and admin-check query to expose whether the current caller is an authenticated admin.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication on ICP, managing login state, identity persistence, and AuthClient creation with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks (queries and mutations) for all backend actor operations including homepage content, services, testimonials, gallery images, and bookings.",
  "frontend/src/index.css": "Global stylesheet that imports Google Fonts, sets up Tailwind CSS layers, and defines a dark industrial theme using OKLCH CSS custom properties along with utility classes for gradients, hover effects, and brand styling.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminPanel.tsx": "Admin panel page protected by AdminGuard that renders tabbed content management sections for homepage, services, testimonials, gallery, and bookings.",
  "frontend/src/pages/HomePage.tsx": "Public-facing home page that composes all main sections: hero, services, booking form, about, testimonials, gallery, and contact.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining a dark industrial theme with OKLCH-based color tokens, custom brand colors (navy, accent-yellow, accent-orange), typography/container-queries plugins, and animation keyframes.",
  "project_state.json": "Tracks the overall project state (version 5) for the Drone X Solutions website, including feature list, architectural notes, and known issues for a drone cleaning business site with admin panel and multi-language support."
}