{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix text contrast — bright white text across all sections",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Set all text elements in ServicesSection.tsx to bright white (#FFFFFF) for maximum contrast against the dark background",
      "acceptanceCriteria": [
        "The 'WHAT WE DO' label is clearly visible in orange or white",
        "The 'Our Services' heading renders in bright white (#FFFFFF)",
        "All service card titles are bright white and legible",
        "All service card description/body text is bright white and legible against the dark background",
        "All feature/icon labels are bright white and legible"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ServicesSection.tsx",
          "operation": "modify",
          "description": "Update all text color classes to use text-white (#FFFFFF) for section label, heading, subtitle, service card titles, service card descriptions, and feature labels. Replace any text-gray-* or text-zinc-* classes with text-white to ensure maximum contrast on the dark background."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Set all navigation link text in Layout.tsx to bright white (#FFFFFF) with sufficient opacity across all scroll states",
      "acceptanceCriteria": [
        "All navigation links (Services, About, Testimonials, Gallery, Contact) are clearly visible in all scroll states",
        "The header background is always dark (no white/transparent state that makes text invisible)",
        "Nav link text color is bright white (#FFFFFF) or close to it with no gray/muted styling"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Layout.tsx",
          "operation": "modify",
          "description": "Update navigation link text colors to bright white (#FFFFFF) for both desktop and mobile navigation. Ensure nav links use text-white with no opacity reduction or gray tones. If the header background changes on scroll (e.g., becomes white), either maintain a dark background at all times or ensure sufficient contrast by adjusting text color dynamically (dark text on light background). Update logo text to bright white as well."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Set all text elements in AboutSection.tsx to bright white (#FFFFFF) for maximum contrast against the dark background",
      "acceptanceCriteria": [
        "About section heading is bright white and clearly visible",
        "All body/paragraph text in the About section is bright white (#FFFFFF)",
        "Highlight card labels (Eco-Friendly, Precision Tech, Certified Team, Fast Turnaround) are bright white and legible"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AboutSection.tsx",
          "operation": "modify",
          "description": "Update all text color classes to use text-white (#FFFFFF) for the section heading, all body/paragraph text, and highlight card labels (Eco-Friendly, Precision Tech, Certified Team, Fast Turnaround). Replace any text-gray-* or text-zinc-* classes with text-white to ensure legibility on the dark background."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Audit and apply bright white (#FFFFFF) text to all remaining page sections (Hero, Testimonials, Gallery, Booking Form, Contact) for consistent maximum-contrast styling",
      "acceptanceCriteria": [
        "All headings, body text, labels, and descriptions across Hero, Testimonials, Gallery, Booking Form, and Contact sections are bright white on dark backgrounds",
        "No text element appears invisible or low-contrast against any dark background",
        "Orange accent color (#F97316 or equivalent) is preserved for decorative/accent elements"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/HeroSection.tsx",
          "operation": "modify",
          "description": "Update all text color classes to use text-white (#FFFFFF) for the hero title, subtitle, badge text, and any other text elements. Preserve orange accent color for decorative elements (e.g., accent words, icons). Replace any gray or muted text colors with text-white."
        },
        {
          "path": "frontend/src/components/TestimonialsSection.tsx",
          "operation": "modify",
          "description": "Update all text color classes to use text-white (#FFFFFF) for section heading, customer names, testimonial text, and any labels. Replace any text-gray-* or text-zinc-* classes with text-white to ensure legibility on the dark background. Preserve orange accent for decorative elements."
        },
        {
          "path": "frontend/src/components/GallerySection.tsx",
          "operation": "modify",
          "description": "Update all text color classes to use text-white (#FFFFFF) for section heading, gallery item descriptions, location labels, and any other text elements. Replace any gray or muted text colors with text-white. Preserve orange accent for toggle buttons or icons."
        },
        {
          "path": "frontend/src/components/BookingForm.tsx",
          "operation": "modify",
          "description": "Update all text color classes to use text-white (#FFFFFF) for form labels, input placeholders, validation messages, success/confirmation text, and any other text elements. Ensure form inputs have sufficient contrast (white text on dark input backgrounds or dark text on light input backgrounds). Preserve orange accent for buttons and decorative elements."
        },
        {
          "path": "frontend/src/components/ContactSection.tsx",
          "operation": "modify",
          "description": "Update all text color classes to use text-white (#FFFFFF) for section heading, contact information labels (phone, email, address), social media link text, and any other text elements. Replace any gray or muted text colors with text-white. Preserve orange accent for icons and CTA buttons."
        }
      ]
    }
  ]
}